{
  "camera": {
    "Default": {
      "camRadius": 20.0,
      "camHeightDeg": 15,
      "camTiltDeg": 0,
      "omegaDegPerSec": 20,
      "fov": 50
    }
  },
  "geometry": {
    "Default": {
      "topology": "torus",
      "R": 1.0,
      "lat": 24,
      "lon": 24,
      "N": 250,
      "phi_g": 3.88322,
      "R_major": 1.2,
      "r_minor": 0.45,
      "eps1": 1.0,
      "eps2": 1.0,
      "ax": 1.0,
      "ay": 1.0,
      "az": 1.0,
      "geo_level": 1,
      "mobius_w": 0.4,
      "trunc_ratio": 0.333,
      "stellated_scale": 1.4,
      "arch_a": 0.0,
      "arch_b": 0.6,
      "theta_max": 6.28318,
      "log_a": 0.2,
      "log_b": 0.15,
      "rose_k": 4.0,
      "sf2_m": 6.0,
      "sf2_a": 1.0,
      "sf2_b": 1.0,
      "sf2_n1": 0.5,
      "sf2_n2": 0.5,
      "sf2_n3": 0.5,
      "density_pdf": "1",
      "poisson_dmin": 0.05,
      "lissajous_a": 3.0,
      "lissajous_b": 2.0,
      "lissajous_phase": 0.0,
      "vogel_k": 2.3999632,
      "se_n1": 1.0,
      "se_n2": 1.0,
      "half_height": 1.0,
      "noisy_amp": 0.1,
      "noisy_freq": 3.0,
      "noisy_gain": 1.0,
      "noisy_omega": 0.0,
      "sph_terms": "2,0,0.4;3,2,0.2",
      "weight_map": "1",
      "R_major2": 0.8,
      "torus_knot_p": 3,
      "torus_knot_q": 2,
      "strip_w": 0.4,
      "strip_n": 2,
      "blob_noise_amp": 0.25,
      "blob_noise_scale": 2.0,
      "gyroid_scale": 1.0,
      "gyroid_thickness": 0.05,
      "gyroid_c": 0.0,
      "schwarz_scale": 1.0,
      "schwarz_iso": 0.0,
      "heart_scale": 1.0,
      "metaballs_centers": "0,0,0",
      "metaballs_radii": "0.6",
      "metaballs_iso": 1.0,
      "polyhedron_data": "",
      "poly_layers": 1,
      "poly_link_steps": 0,
      "df_ops": "sphere(1.0)",
      "sf3_m1": 3.0,
      "sf3_m2": 3.0,
      "sf3_m3": 3.0,
      "sf3_n1": 0.5,
      "sf3_n2": 0.5,
      "sf3_n3": 0.5,
      "sf3_a": 1.0,
      "sf3_b": 1.0,
      "sf3_scale": 1.0,
      "helix_r": 0.4,
      "helix_pitch": 0.3,
      "helix_turns": 3.0,
      "lissajous3d_Ax": 1.0,
      "lissajous3d_Ay": 1.0,
      "lissajous3d_Az": 1.0,
      "lissajous3d_wx": 3.0,
      "lissajous3d_wy": 2.0,
      "lissajous3d_wz": 5.0,
      "lissajous3d_phi": 0.0,
      "viviani_a": 1.0,
      "lic_N": 12,
      "lic_steps": 180,
      "lic_h": 0.05,
      "stream_N": 12,
      "stream_steps": 220,
      "geo_graph_level": 2,
      "rgg_nodes": 400,
      "rgg_radius": 0.2,
      "rings_count": 5,
      "ring_points": 96,
      "hex_step": 0.2,
      "hex_nx": 12,
      "hex_ny": 12,
      "voronoi_N": 50,
      "voronoi_bbox": "-1,1,-1,1"
    }
  },
  "appearance": {
    "Default": {
      "color": "#00C8FF",
      "colors": "#00C8FF@0,#FFFFFF@1",
      "opacity": 1.0,
      "px": 2.0,
      "palette": "uniform",
      "paletteK": 2,
      "h0": 200.0,
      "dh": 0.0,
      "wh": 0.0,
      "blendMode": "source-over",
      "shape": "circle",
      "alphaDepth": 0.0,
      "noiseScale": 1.0,
      "noiseSpeed": 0.0,
      "pxModMode": "none",
      "pxModAmp": 0.0,
      "pxModFreq": 0.0,
      "pxModPhaseDeg": 0.0
    }
  },
  "dynamics": {
    "Default": {
      "rotX": 0.0,
      "rotY": 0.0,
      "rotZ": 0.0,
      "rotXMax": 360.0,
      "rotYMax": 360.0,
      "rotZMax": 360.0,
      "orientXDeg": 0.0,
      "orientYDeg": 0.0,
      "orientZDeg": 0.0,
      "pulseA": 0.0,
      "pulseW": 1.0,
      "pulsePhaseDeg": 0.0,
      "rotPhaseDeg": 0.0,
      "rotPhaseMode": "none",
      "orientationSnapAngles": [
        -180,
        -135,
        -120,
        -90,
        -60,
        -45,
        -30,
        -15,
        0,
        15,
        30,
        45,
        60,
        90,
        120,
        135,
        180
      ],
      "phaseSnapAngles": [
        0,
        30,
        45,
        60,
        90,
        120,
        135,
        150,
        180,
        210,
        225,
        240,
        270,
        300,
        315,
        330,
        360
      ]
    }
  },
  "distribution": {
    "Default": {
      "densityMode": "uniform",
      "sampler": "direct",
      "dmin": 0.0,
      "dmin_px": 0.0,
      "maskMode": "none",
      "maskSoftness": 0.2,
      "maskAnimate": 0.0,
      "noiseDistortion": 0.0,
      "densityPulse": 0.0,
      "clusterCount": 1,
      "clusterSpread": 0.0,
      "repelForce": 0.0,
      "noiseWarp": 0.0,
      "fieldFlow": 0.0,
      "pr": "uniform_area"
    }
  },
  "system": {
    "Default": {
      "Nmax": 50000,
      "dprClamp": 2.0,
      "depthSort": true,
      "transparent": true,
      "markerCircles": {
        "red": 0.16,
        "yellow": 0.19,
        "blue": 0.22
      }
    }
  },
  "orbit": {
    "Default": {
      "donutGravityStrength": 1.0,
      "donutGravityFalloff": 1.0,
      "donutGravityRingOffset": 12.0,
      "orbitSpeed": 1.0,
      "orbiterTransitionMode": "default",
      "orbiterSnapMode": "default",
      "orbiterDetachMode": "default",
      "orbiterTrajectory": "line",
      "orbiterApproachTrajectory": "line",
      "orbiterReturnTrajectory": "line",
      "orbiterTransitionDuration": 700.0,
      "orbiterApproachDuration": 700.0,
      "orbiterReturnDuration": 700.0,
      "orbiterTrajectoryBend": 0.35,
      "orbiterTrajectoryArcDirection": "auto",
      "orbiterSpiralTurns": 1.5,
      "orbiterSpiralTightness": 0.35,
      "orbiterWaveAmplitude": 0.3,
      "orbiterWaveFrequency": 3.0,
      "orbiterTrailBlend": 0.7,
      "orbiterTrailSmoothing": 0.4,
      "orbiterTrailMemorySeconds": 2.0,
      "orbiterRequiredTurns": 1.0,
      "orbiterMaxOrbitMs": 4000.0
    }
  },
  "indicator": {
    "Default": {
      "centerLines": {
        "all": false,
        "buttons": {
          "1": false,
          "2": false,
          "3": false,
          "4": false,
          "5": false,
          "6": false,
          "7": false,
          "8": false,
          "9": false,
          "10": false
        }
      },
      "yellowCircleRatio": 0.19,
      "orbitalZones": {
        "enabled": true,
        "diameters": [
          120.0,
          120.0,
          120.0,
          120.0,
          120.0,
          120.0,
          120.0,
          120.0,
          120.0,
          120.0
        ],
        "mode": "free"
      }
    }
  }
}